cmsis-svd/cmsis-svd/data/Renesas/R7FA6T1AD.svd
                <register>
                    <name>SPTR</name>
                    <description>Serial Port Register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x03</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>3</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPB2IO</name>
                            <description>Serial port break I/O bit
(It's selected whether the value of SPB2DT is output to TxD terminal.)</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The value of SPB2DT bit isn't output in TxD terminal.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The value of SPB2DT bit is output in TxD terminal.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SPB2DT</name>
                            <description>Serial port break data select bit
(The output level of TxD terminal is selected when SCR.TE = 0.)</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Low level is output in TxD terminal.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>High level is output in TxD terminal.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RXDMON</name>
                            <description>Serial input data monitor bit
(The state of the RXD terminal is shown.)</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>RXD terminal is the Low level. </description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>RXD terminal is the High level.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI1</name>
            <description>Serial Communication Interface 1</description>
            <baseAddress>0x40070020</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI2</name>
            <description>Serial Communication Interface 2</description>
            <baseAddress>0x40070040</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI3</name>
            <description>Serial Communication Interface 3</description>
            <baseAddress>0x40070060</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI4</name>
            <description>Serial Communication Interface 4</description>
            <baseAddress>0x40070080</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI8</name>
            <description>Serial Communication Interface 8</description>
            <baseAddress>0x40070100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI9</name>
            <description>Serial Communication Interface 9</description>
            <baseAddress>0x40070120</baseAddress>
        </peripheral>
        <peripheral>
            <name>GPT328</name>
            <description>General PWM Timer 8 </description>
            <baseAddress>0x40078800</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>116</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x7C</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x74</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x80</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x78</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x84</offset>
                <size>32</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>GTWP</name>
                    <description>General PWM Timer Write-Protection Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000. The write value should be 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRKEY</name>
                            <description>GTWP Key Code</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0xA5</name>
                                    <description>Written to these bits, the WP bits write is permitted. </description>
                                    <value>0xA5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>The WP bits write is not permitted. </description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WP</name>
                            <description>Register Write Disable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Enable writes to the register</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Disable writes to the register</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
