cmsis-svd/cmsis-svd/data/Renesas/R7FA6T1AD.svd
                <register>
                    <name>GTIOR</name>
                    <description>General PWM Timer I/O Control Register</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>NFCSB</name>
                            <description>Noise Filter B Sampling Clock Select</description>
                            <lsb>30</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>PCLK/1</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>PCLK/4</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>PCLK/16</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>PCLK/64</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NFBEN</name>
                            <description>Noise Filter B Enable</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable noise filter for GTIOCB pin</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable noise filter for GTIOCB pin</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>27</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OBDF</name>
                            <description>GTIOCB Pin Disable Value Setting</description>
                            <lsb>25</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Prohibit output disable</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Set GTIOCB pin to Hi-Z on output disable</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Set GTIOCB pin to 0 on output disable</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Set GTIOCB pin to 1 on output disable.</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OBE</name>
                            <description>GTIOCB Pin Output Enable</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable output</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable output</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OBHLD</name>
                            <description>GTIOCB Pin Output Setting at the Start/Stop Count</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Set GTIOCB pin output level on counting start and stop based on the register setting</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Retain GTIOCB pin output level on counting start and stop</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OBDFLT</name>
                            <description>GTIOCB Pin Output Value Setting at the Count Stop</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Output low on GTIOCB pin when counting stops</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Output high on GTIOCB pin when counting stops</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GTIOB</name>
                            <description>GTIOCB Pin Function Select</description>
                            <lsb>16</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00000</name>
                                    <description>Initial output is Low. Output retained at cycle end. Output retained at GTCCRB compare match.</description>
                                    <value>#00000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00001</name>
                                    <description>Initial output is Low. Output retained at cycle end. Low output at GTCCRB compare match.</description>
                                    <value>#00001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00010</name>
                                    <description>Initial output is Low. Output retained at cycle end. High output at GTCCRB compare match.</description>
                                    <value>#00010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00011</name>
                                    <description>Initial output is Low. Output retained at cycle end. Output toggled at GTCCRB compare match.</description>
                                    <value>#00011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00100</name>
                                    <description>Initial output is Low. Low output at cycle end. Output retained at GTCCRB compare match.</description>
                                    <value>#00100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00101</name>
                                    <description>Initial output is Low. Low output at cycle end. Low output at GTCCRB compare match.</description>
                                    <value>#00101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00110</name>
                                    <description>Initial output is Low. Low output at cycle end. High output at GTCCRB compare match.</description>
                                    <value>#00110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00111</name>
                                    <description>Initial output is Low. Low output at cycle end. Output toggled at GTCCRB compare match.</description>
                                    <value>#00111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01000</name>
                                    <description>Initial output is Low. High output at cycle end. Output retained at GTCCRB compare match.</description>
                                    <value>#01000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01001</name>
                                    <description>Initial output is Low. High output at cycle end. Low output at GTCCRB compare match.</description>
                                    <value>#01001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01010</name>
                                    <description>Initial output is Low. High output at cycle end. High output at GTCCRB compare match.</description>
                                    <value>#01010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01011</name>
                                    <description>Initial output is Low. High output at cycle end. Output toggled at GTCCRB compare match.</description>
                                    <value>#01011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01100</name>
                                    <description>Initial output is Low. Output toggled at cycle end. Output retained at GTCCRB compare match.</description>
                                    <value>#01100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01101</name>
                                    <description>Initial output is Low. Output toggled at cycle end. Low output at GTCCRB compare match.</description>
                                    <value>#01101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01110</name>
                                    <description>Initial output is Low. Output toggled at cycle end. High output at GTCCRB compare match.</description>
                                    <value>#01110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01111</name>
                                    <description>Initial output is Low. Output toggled at cycle end. Output toggled at GTCCRB compare match.</description>
                                    <value>#01111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10000</name>
                                    <description>Initial output is High. Output retained at cycle end. Output retained at GTCCRB compare match.</description>
                                    <value>#10000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10001</name>
                                    <description>Initial output is High. Output retained at cycle end. Low output at GTCCRB compare match.</description>
                                    <value>#10001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10010</name>
                                    <description>Initial output is High. Output retained at cycle end. High output at GTCCRB compare match.</description>
                                    <value>#10010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10011</name>
                                    <description>Initial output is High. Output retained at cycle end. Output toggled at GTCCRB compare match.</description>
                                    <value>#10011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10100</name>
                                    <description>Initial output is High. Low output at cycle end. Output retained at GTCCRB compare match.</description>
                                    <value>#10100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10101</name>
                                    <description>Initial output is High. Low output at cycle end. Low output at GTCCRB compare match.</description>
                                    <value>#10101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10110</name>
                                    <description>Initial output is High. Low output at cycle end. High output at GTCCRB compare match.</description>
                                    <value>#10110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10111</name>
                                    <description>Initial output is High. Low output at cycle end. Output toggled at GTCCRB compare match.</description>
                                    <value>#10111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11000</name>
                                    <description>Initial output is High. High output at cycle end. Output retained at GTCCRB compare match.</description>
                                    <value>#11000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11001</name>
                                    <description>Initial output is High. High output at cycle end. Low output at GTCCRB compare match.</description>
                                    <value>#11001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11010</name>
                                    <description>Initial output is High. High output at cycle end. High output at GTCCRB compare match.</description>
                                    <value>#11010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11011</name>
                                    <description>Initial output is High. High output at cycle end. Output toggled at GTCCRB compare match.</description>
                                    <value>#11011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11100</name>
                                    <description>Initial output is High. Output toggled at cycle end. Output retained at GTCCRB compare match.</description>
                                    <value>#11100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11101</name>
                                    <description>Initial output is High. Output toggled at cycle end. Low output at GTCCRB compare match.</description>
                                    <value>#11101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11110</name>
                                    <description>Initial output is High. Output toggled at cycle end. High output at GTCCRB compare match.</description>
                                    <value>#11110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11111</name>
                                    <description>Initial output is High. Output toggled at cycle end. Output toggled at GTCCRB compare match.</description>
                                    <value>#11111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NFCSA</name>
                            <description>Noise Filter A Sampling Clock Select</description>
                            <lsb>14</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>PCLK/1</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>PCLK/4</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>PCLK/16</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>PCLK/64</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NFAEN</name>
                            <description>Noise Filter A Enable</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable noise filter for GTIOCA pin</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable noise filter for GTIOCA pin.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>11</lsb>
